1c-config/src/Catalogs/венд_МобильныеУстройства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>венд_МобильныеУстройства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>АвтоПроведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПривязки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-config/src/Catalogs/венд_МобильныеУстройства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьQR();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Код прив'язки змінюється тільки при записі — перемальовуємо QR за збереженими даними.
	СформироватьQR();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьКодПривязки(Команда)
	// Новий одноразовий код прив'язки. Анулює раніше виданий токен (переприв'язка):
	// очищаємо хеш, щоб старий токен перестав діяти. Потрібно зберегти запис.
	Объект.КодПривязки = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	Объект.ХешТокена = "";
	Модифицированность = Истина;
	ПоказатьПредупреждение(, НСтр("uk='Згенеровано новий код прив''язки. Збережіть пристрій — і QR оновиться.'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьQR()
	// Без GUID кодувати нічого
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторУстройства) Тогда
		АдресКартинкиQR = "";
		Возврат;
	КонецЕсли;
	// Вміст QR — формат, що очікує мобільний сканер (scanner.js -> parseQr):
	// JSON { deviceId, apiUrl, code }. code — одноразовий код прив'язки (обмінюється на токен у /auth).
	АдресСервиса = Константы.венд_АдресМобильногоСервиса.Получить();
	Содержимое = "{""deviceId"":""" + Объект.ИдентификаторУстройства + """,""apiUrl"":""" + АдресСервиса
		+ """,""code"":""" + СокрЛП(Объект.КодПривязки) + """}";
	ДвоичныеДанные = УправлениеПечатью.ДанныеQRКода(Содержимое, 1, 200);
	АдресКартинкиQR = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);
КонецПроцедуры

#КонецОбласти
